Tekla.Structures.Drawing.Polygon
The Polygon class defines a polygon that is a multipoint line which is connected. It can also have a bulge (curved lines).
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
if(MyDrawingHandler.GetConnectionStatus())
{
Polygon MyPolygon;
PointList PolygonPoints = new PointList();
PolygonPoints.Add(new Point(10,10));
PolygonPoints.Add(new Point(50,10));
PolygonPoints.Add(new Point(50,50));
PolygonPoints.Add(new Point(10,50));
DrawingObjectEnumerator views = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
while(views.MoveNext())
{
MyPolygon = new Polygon(views.Current as ViewBase, PolygonPoints);
MyPolygon.Insert();
}
}
}
}

Tekla.Structures.Drawing.Polygon.Points
The list of points for the polygon.

Tekla.Structures.Drawing.Polygon.Bulges
The list of individual bulges for the polygon.

Tekla.Structures.Drawing.Polygon.Bulge
The bulge (curve) to use for the polygon (a bulge is the ratio between the height and width of an object).

Tekla.Structures.Drawing.Polygon.Attributes
The attributes for the polygon.

Tekla.Structures.Drawing.Polygon.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.Polygon.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Drawing.PointList,Tekla.Structures.Drawing.Polygon.PolygonAttributes)
Creates a new polygon instance with the point list using the given attributes.
view: The view to be used.
pointList: The point list to be used.
attributes: The polygon attributes to be used.

Tekla.Structures.Drawing.Polygon.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Drawing.PointList)
Creates a new polygon instance with the point list using standard attributes.
view: The view to be used.
pointList: The point list to be used.

Tekla.Structures.Drawing.Polygon.Delete
Calls the system to delete the object.
Returns: True on success.

Tekla.Structures.Drawing.Polygon.Modify
Calls the system to update/modify the object.
Returns: True on success.

Tekla.Structures.Drawing.Polygon.Insert
Calls the system to insert the new object.
Returns: True on success.

Tekla.Structures.Drawing.Polygon.Select
Calls the system to select and retrieve the object.
Returns: True on success.